# 1)	Создать список и заполнить его элементами различных типов данных.
#   Реализовать скрипт проверки типа данных каждого элемента.
#   Использовать функцию type() для проверки типа.
#    Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list = ['abc', 4, 2.01, 'apple']
print(type(list))
print(type(list[0]),type(list[1]),type(list[2]),type(list[3]))